[
      {
            "id": 1,
            "title": "A Song of Fire and Ice",
            "price": 25,
            "imageUrl": "https://upload.wikimedia.org/wikipedia/en/d/dc/A_Song_of_Ice_and_Fire_book_collection_box_set_cover.jpg",
            "description": " A Song of Ice and Fire is a series of epic fantasy novels by the American novelist and screenwriter George R. R. Martin. He began the first volume of the series, A Game of Thrones, in 1991, and it was published in 1996.",
            "createdAt": null,
            "updatedAt": null,
            "userId": 1
      },
      {
            "id": 2,
            "title": "A Clash of Kings (A Song of Ice and Fire, Book 2)",
            "price": 29.54,
            "imageUrl": "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1557252558-51cRzw2Kj7L.jpg?crop=1xw:1xh;center,top&resize=768:*",
            "description": " Set 300 years before the events in A Song of Ice and Fire, Fire and Blood is the definitive history of the Targaryens in Westeros as told by Archmaester Gyldayn, and chronicles the conquest that united the Seven Kingdoms under Targaryen rule through to t",
            "createdAt": null,
            "updatedAt": null,
            "userId": 1
      },
      {
            "id": 3,
            "title": "A Game of Thrones",
            "price": 26.45,
            "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIc-H9My9FtjycLDSrkfK_rv3vS-tGklB8XFQ4a1yc1WobpJeN",
            "description": " A Game of Thrones is the first novel in A Song of Ice and Fire, a series of fantasy novels by the American author George R. R. Martin. It was first published on August 1, 1996. The novel won the 1997 Locus Award and was nominated for both the 1997 Nebula",
            "createdAt": null,
            "updatedAt": null,
            "userId": 1
      },
      {
            "id": 4,
            "title": "A Storm of Swords",
            "price": 25.99,
            "imageUrl": "https://awoiaf.westeros.org/images/thumb/2/24/AStormOfSwords.jpg/200px-AStormOfSwords.jpg",
            "description": " A Storm of Swords picks up the story where A Clash of Kings ends. The Seven Kingdoms are in the grip of the War of the Five Kings, with Robb Stark, Balon Greyjoy, Renly Baratheon, Joffrey Baratheon, and Stannis Baratheon fighting to secure their crowns, ",
            "createdAt": null,
            "updatedAt": null,
            "userId": 1
      }
]